src/app/Traits/AppSettingsTrait.php

    protected function saveSettings(string $key, mixed $value): void
    {
        // Verify that we are not trying to save over a fake password
        if ($value !== __('admin.fake-password') && $value !== null) {
            Log::debug('Saving Permission Value for '.$key);

            // Verify that the value has actually changed
            if (config($key) != $value) {
                AppSettings::firstOrCreate(
                    ['key' => $key],
                    ['value' => json_encode($value)]
                )->update(['value' => json_encode($value)]);
---
insert into `app_settings` (`key`, `value`, `updated_at`, `created_at`) values ('auth.passwords.settings.min_length', '3', '2025-01-18 03:54:54', '2025-01-18 03:54:54')
select * from `app_settings` where (`key` = 'auth.passwords.settings.min_length') limit 1

    protected function clearSetting(string $key): void
    {
        $data = AppSettings::where('key', $key)->first();
        if ($data) {
            $data->delete();
---
select * from `app_settings` where `key` = 'app.first_time_setup' limit 1
delete from `app_settings` where `id` = 1