src/app/Actions/Setup/BuildApplication.php

select * from `users` where `users`.`user_id` = 1 and `users`.`deleted_at` is null limit 1
---
    protected function buildAdminAccount(): void
    {
        event(new AdministrationEvent('Saving Admin Account'));

        User::find(1)->update($this->appSettingsData['admin']);

select * from `users` where `users`.`user_id` = 1 and `users`.`deleted_at` is null limit 1
update `users` set `password` = '$2y$12$b2dtgPASe1xxX1UEHBoci.O0VuAiszg7FBdWLI4FVvvmoiQ..Jd4K', `password_expires` = '2025-02-17 03:54:55', `users`.`updated_at` = '2025-01-18 03:54:55' where `user_id` = 1
---
    protected function setAdminPassword(): void
    {
        event(new AdministrationEvent('Saving Administrator Password'));

        $pass = $this->appSettingsData['administrator-password']['password'];
        $user = User::find(1);
        $user->forceFill([
            'password' => Hash::make($pass),
            'password_expires' => $user->getNewExpireTime(),
        ])->save();