src/app/Http/Controllers/Init/StepFourController.php

    public function __invoke(Request $request)
    {
        $user = $request->session()
            ->get('setup.administrator-account')
            ?: $request->user()->makeVisible(['role_id']);

        return Inertia::render('Init/StepFour', [
            'step' => 4,
            'rules' => CacheData::passwordRules(),
            'roles' => [UserRole::find(1)],
---
select * from `user_roles` where `user_roles`.`role_id` = 1 limit 1